/* ------------------------------------------------------------
 * 版本:1.0
 * 描述:reui组件定义说明
 * ------------------------------------------------------------ */
+function ($) {
    // 动画速度
    var speed = reui.config.speed;

    // ------------------------------------------------------------
    // 定义:Conponent组件类
    // reui.module()方法构建组件时，会自动传递组件的jQuery对象做为$element参数
    // $element:组件的jQuery对象
    // ------------------------------------------------------------
    var Conponent = function ($element) {
        this.$ = $element;
    };

    // ------------------------------------------------------------
    // Conponent.prototype.animate();
    // 每个组件有一个隐式定义(reui.js中自动定义)的animate方法，返回是否启用动画
    // ------------------------------------------------------------

    // ------------------------------------------------------------
    // Conponent.prototype.speed();
    // 每个组件有一个隐式定义(reui.js中自动定义)的speed方法，返回动画的过渡时间
    // ------------------------------------------------------------

    // 定义:Conponent组件的类选择器
    // ------------------------------
    Conponent.prototype.selector = '.jsx-conponent';

    // ------------------------------------------------------------
    // 方法:reui调用的入口方法
    // 如果指定此函数，页面加载时，会自动调用该方法
    // ------------------------------------------------------------
    Conponent.prototype.init = function () {

    };

    // 注册成reui模块
    // ------------------------------
    reui.module(Sidebar);
}(jQuery);